cloudn1ne/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
		// Orientation (Magnetometer)
		imu_mag_msg.header.frame_id = "imu";								
	 	IMU_ReadMagnetometer(&x, &y, &z);
		imu_mag_msg.magnetic_field.x = x;
		imu_mag_msg.magnetic_field.y = y;
		imu_mag_msg.magnetic_field.z = z;

		// covariance is fixed for now
		imu_mag_msg.magnetic_field_covariance[0] = 1e-3;
		imu_mag_msg.magnetic_field_covariance[4] = 1e-3;
		imu_mag_msg.magnetic_field_covariance[8] = 1e-3;
		imu_mag_msg.header.stamp = nh.now();
		pubIMUMag.publish(&imu_mag_msg);

		/******************************************/
		/* Exernal Magnetometer RAW (Calibration) */
		/******************************************/
		IMU_ReadMagnetometerRaw(&x, &y, &z);
		imu_mag_calibration_msg.x = x;
		imu_mag_calibration_msg.y = y;
		imu_mag_calibration_msg.z = z;

		imu_mag_msg.header.stamp = nh.now();
		pubIMUMagCalibration.publish(&imu_mag_calibration_msg);

		/**********************************/
		/* Onboard (GForce) Accelerometer */
		/**********************************/
#ifdef IMU_ONBOARD_ACCELERATION
		IMU_Onboard_ReadAccelerometer(&imu_onboard_msg.linear_acceleration.x, &imu_onboard_msg.linear_acceleration.y, &imu_onboard_msg.linear_acceleration.z);		
		IMU_Onboard_AccelerometerSetCovariance(imu_onboard_msg.linear_acceleration_covariance);	
#else
		imu_onboard_msg.linear_acceleration.x = imu_onboard_msg.linear_acceleration.y = imu_onboard_msg.linear_acceleration.z = 0;		
#endif
		// no onboard gyro so angular velocities are always zero
		imu_onboard_msg.angular_velocity.x = imu_onboard_msg.angular_velocity.y = imu_onboard_msg.angular_velocity.z = 0;		
		imu_onboard_msg.angular_velocity_covariance[0] = -1;		// indicate *not valid* to EKF
		imu_onboard_msg.header.stamp = nh.now();
		pubIMUOnboard.publish(&imu_onboard_msg);		
	  } // if (NBT_handler(&imu_nbt))

  	  if (NBT_handler(&status_nbt))
	  {
		////////////////////////////////////////
		// mowgli/status Message
		////////////////////////////////////////		
		status_msg.stamp = nh.now();
		status_msg.rain_detected = RAIN_Sense();
		status_msg.emergency_tilt_mech_triggered = Emergency_Tilt();
		status_msg.emergency_tilt_accel_triggered = Emergency_LowZAccelerometer();
		status_msg.emergency_left_wheel_lifted = Emergency_WheelLiftBlue();
		status_msg.emergency_right_wheel_lifted = Emergency_WheelLiftRed();
		status_msg.emergency_stopbutton_triggered = Emergency_StopButtonYellow() || Emergency_StopButtonWhite();
		status_msg.left_encoder_ticks = left_encoder_ticks;
		status_msg.right_encoder_ticks = right_encoder_ticks;
		status_msg.v_charge = charge_voltage;
		status_msg.i_charge = charge_current;
		status_msg.v_battery = battery_voltage;
		status_msg.charge_pwm = chargecontrol_pwm_val;
		status_msg.is_charging = chargecontrol_is_charging;
		status_msg.imu_temp = imu_onboard_temperature;
		status_msg.blade_motor_ctrl_enabled = true;	// hardcoded for now
		status_msg.drive_motor_ctrl_enabled = true; // hardcoded for now
		pubStatus.publish(&status_msg);		
	  } // if (NBT_handler(&status_nbt))

	  if (NBT_handler(&odom_nbt))
	  {	
		/* first odom_nbt call sets our "odom_last_time" */
		if (odom_last_time.nsec == 0 )						
		{
			odom_last_time = nh.now();		
		}
		else		
		{	/* subsequent odom_nbts publish odom messages */		

			/* dynamic dt calculation */
			odom_current_time = nh.now();	
			uint32_t odom_current_time_msec = odom_current_time.sec*1000 + odom_current_time.nsec/1000000.0;
			uint32_t odom_last_time_msec = odom_last_time.sec*1000 + odom_last_time.nsec/1000000.0;			
			dt = (odom_current_time_msec - odom_last_time_msec) / 1000.0;


			speed_act_left = left_wheel_speed_val/PWM_PER_MPS;			// wheel speed in m/s
			speed_act_right = right_wheel_speed_val/PWM_PER_MPS;		// wheel speed in m/s			

			/* calculate distances from accumulating wheel encoder ticks */
			if (left_encoder_ticks>=left_encoder_ticks_old)
				distance_left = (left_encoder_ticks-left_encoder_ticks_old)/TICKS_PER_M;
			else 
				distance_left = -1.0 * (left_encoder_ticks_old-left_encoder_ticks)/TICKS_PER_M;
			
			if (right_encoder_ticks>right_encoder_ticks_old)			
				distance_right = (right_encoder_ticks-right_encoder_ticks_old)/TICKS_PER_M;
			else
				distance_right = -1.0 * (right_encoder_ticks_old-right_encoder_ticks)/TICKS_PER_M;

			// only continue with calculating an odom message if we are moving, 
			// or 0.5 sec are elapsed since the last odom message was published
			if (distance_left != 0 || distance_right != 0 || dt > 0.5)
			{
				odom_last_time = nh.now();
				// debug_printf("left_encoder_ticks: (%d/%d) right_encoder_ticks: (%d/%d) distance_left: %f distance_right: %f\r\n", left_encoder_ticks, left_encoder_ticks_old, right_encoder_ticks, right_encoder_ticks_old, distance_left, distance_right);				
				// dt = (ODOM_NBT_TIME_MS/1000.0);			
				// 	debug_printf("left_encoder_val: %d right_encoder_val: %d dt: %f speed_act_left: %f speed_act_right: %f\r\n",left_encoder_val, right_encoder_val, dt, speed_act_left, speed_act_right);			

			
			
				dx = (distance_left+distance_right)/2.0;
				dy = 0;

				//	dxy = (speed_act_left+speed_act_right)*dt/2.0;
				dth = - 1.0 * ((speed_act_right-speed_act_left)*dt)/WHEEL_BASE;
				
				if (dth > 0) dth *= angular_scale_positive;
				if (dth < 0) dth *= angular_scale_negative;
				//if (dxy > 0) dxy *= linear_scale_positive;
				//if (dxy < 0) dxy *= linear_scale_negative;

				//	dx = cos(dth) * dxy;
				//  dy = sin(dth) * dxy;

				x_pos += (cos(theta) * dx - sin(theta) * dy);
				y_pos += (sin(theta) * dx + cos(theta) * dy);

			//	debug_printf("dx: %f x_pos: %f dth: %f\r\n", dx, x_pos, dth);		

				theta += dth;

				if(theta >= two_pi) theta -= two_pi;
				if(theta <= -two_pi) theta += two_pi;

				left_encoder_ticks_old = left_encoder_ticks;
				right_encoder_ticks_old = right_encoder_ticks;

				quat = tf::createQuaternionFromYaw(theta);
				//////////////////////////////////////////////////
				// odom message
				//////////////////////////////////////////////////
				odom_msg.header.stamp = nh.now(); 	
				odom_msg.header.frame_id = odom;
				odom_msg.pose.pose.position.x = x_pos;
				odom_msg.pose.pose.position.y = y_pos;
				odom_msg.pose.pose.position.z = 0.0;
				odom_msg.pose.pose.orientation = quat;
				if (speed_act_left == 0 && speed_act_right == 0){
					odom_msg.pose.covariance[0] = 1e-9;
					odom_msg.pose.covariance[7] = 1e-3;
					odom_msg.pose.covariance[8] = 1e-9;
					odom_msg.pose.covariance[14] = 1e6;
					odom_msg.pose.covariance[21] = 1e6;
					odom_msg.pose.covariance[28] = 1e6;
					odom_msg.pose.covariance[35] = 1e-9;
					odom_msg.twist.covariance[0] = 1e-9;
					odom_msg.twist.covariance[7] = 1e-3;
					odom_msg.twist.covariance[8] = 1e-9;
					odom_msg.twist.covariance[14] = 1e6;
					odom_msg.twist.covariance[21] = 1e6;
					odom_msg.twist.covariance[28] = 1e6;
					odom_msg.twist.covariance[35] = 1e-9;
				}
				else{
					odom_msg.pose.covariance[0] = 1e-3;
					odom_msg.pose.covariance[7] = 1e-3;
					odom_msg.pose.covariance[8] = 0.0;
					odom_msg.pose.covariance[14] = 1e6;
					odom_msg.pose.covariance[21] = 1e6;
					odom_msg.pose.covariance[28] = 1e6;
					odom_msg.pose.covariance[35] = 1e3;
					odom_msg.twist.covariance[0] = 1e-3;
					odom_msg.twist.covariance[7] = 1e-3;
					odom_msg.twist.covariance[8] = 0.0;
					odom_msg.twist.covariance[14] = 1e6;
					odom_msg.twist.covariance[21] = 1e6;
					odom_msg.twist.covariance[28] = 1e6;
					odom_msg.twist.covariance[35] = 1e3;
				}

				vx = (dt == 0)?  0 : (speed_act_left+speed_act_right)/2.0;
			//	vth = (dt == 0)? 0 : (speed_act_right-speed_act_left)/WHEEL_BASE;
				odom_msg.child_frame_id = base_link;
				odom_msg.twist.twist.linear.x = vx;
				odom_msg.twist.twist.linear.y = 0.0;
				odom_msg.twist.twist.angular.z = dth;
				pubOdom.publish(&odom_msg);

			
		   } // movement detected or timeout
		} // first odom_last_time > 0
	  } // if (NBT_handler(&broadcast_nbt))
}

