cloudn1ne/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/*
 *  callback for mowgli/GetCfg Service
 */
void cbGetCfg(const mowgli::GetCfgRequest &req, mowgli::GetCfgResponse &res) 
{	
    debug_printf("cbGetCfg:\r\n");	
	debug_printf(" name: %s\r\n", req.name);

	res.data_length = SPIFLASH_ReadCfgValue(req.name, &res.type, svcCfgDataBuffer);

	if (res.data_length > 0)
	{		
		res.data = (uint8_t*)&svcCfgDataBuffer;	
		res.status = 1;
	}
	else
	{
		res.status = 0;
	}
}

/*
 *  callback for mowgli/SetCfg Service
 */
void cbSetCfg(const mowgli::SetCfgRequest &req, mowgli::SetCfgResponse &res) {
	union {
		float f;
		uint8_t b[4];
	} float_val;

	union {
		double d;
		uint8_t b[8];
	} double_val;
	uint8_t i;

    debug_printf("cbSetCfg:\r\n");
	debug_printf(" type: %d\r\n", req.type);
	debug_printf(" len: %d\r\n", req.data_length);
	debug_printf(" name: %s\r\n", req.name);

	if (req.type == 0) // TYPE_INT32 (0)
	{
		int32_t int32_val = (req.data[0]) + (req.data[1]<<8) + (req.data[2]<<16) + (req.data[3]<<24);
		debug_printf("(int32) data: %d\r\n", int32_val);			
	}
	if (req.type == 1) // TYPE_UINT32 (1)
	{
		uint32_t uint32_val = (req.data[0]) + (req.data[1]<<8) + (req.data[2]<<16) + (req.data[3]<<24);
		debug_printf("(uint32) data: %d\r\n", uint32_val);			
	}
	if (req.type == 2) // TYPE_FLOAT (2)
	{		
		for (i=0;i<4;i++)
		{
			float_val.b[i] = req.data[i];
		}		
		debug_printf("(float) data: %f\r\n", float_val.f);					
	}
	if (req.type == 3)  // TYPE_DOUBLE (3)
	{		
		for (i=0;i<8;i++)
		{
			double_val.b[i] = req.data[i];
		}
		debug_printf("(double) data: %Lf\r\n", double_val.d);			
	}
	if (req.type == 4)	// TYPE_STRING (4)
	{	
		debug_printf("(string) data: '");				
		for (i=0;i<req.data_length;i++)
		{
			debug_printf("%c", req.data[i]);
		}
		debug_printf("'\r\n");	
	}
	if (req.type == 5)	// TYPE_BARRAY (5)
	{	
		debug_printf("(byte array) data: '");				
		for (i=0;i<req.data_length;i++)
		{
			debug_printf("0x%02x ", req.data[i]);
		}
		debug_printf("'\r\n");	
	}

	// debug print data[] array
	for (i=0;i<req.data_length;i++)
	{
		debug_printf(" data[%d]: %d\r\n", i, req.data[i]);	
	}		

	SPIFLASH_WriteCfgValue(req.name, req.type, req.data_length, req.data);
	res.status = 1;
}

/*
 *  callback for mowgli/EnableMowerMotor Service
 */
void cbEnableMowerMotor(const std_srvs::SetBool::Request &req, std_srvs::SetBool::Response &res)
{
	//debug_printf("cbEnableMowerMotor:\r\n");
	last_cmd_blade = nh.now();	// if the last blade cmd is older than 25sec the motor will be stopped !
	blade_on_off = req.data;
    if (req.data) {        		
        res.success = true;
        res.message = "Mower Blade Motor has been started";
    }
    else {
        res.success = false;
        res.message = "Mower Blade Motor is being stopped";
    }    
}

/*
 *  callback for mowgli/Reboot Service
 */
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res)
{
	//debug_printf("cbReboot:\r\n");
	reboot_flag = true;	
}

/*
 * ROS housekeeping
 */
extern "C" void spinOnce()
{
	  if (NBT_handler(&ros_nbt))
	  {
			nh.spinOnce();
	  }
}

/* 
 *  Initialize rosserial
 */
extern "C" void init_ROS()
{
	ringbuffer_init(&rb, RxBuffer, RxBufferSize);

	// Initialize ROS
	nh.initNode();

	// Initialize TF Broadcaster
	broadcaster.init(nh);

	// Initialize Pubs
	//nh.advertise(pubBatteryVoltage);
	//nh.advertise(pubChargeVoltage);
	//nh.advertise(pubChargeCurrent);
	//nh.advertise(pubChargePWM);
	nh.advertise(pubOdom);

	//nh.advertise(pubBladeState);
	//nh.advertise(pubChargeingState);
	//nh.advertise(pubLeftEncoderTicks);
	//nh.advertise(pubRightEncoderTicks);
	nh.advertise(pubButtonState);
	nh.advertise(pubIMU);
	nh.advertise(pubIMUMag);
	nh.advertise(pubIMUMagCalibration);
	nh.advertise(pubIMUOnboard);
	//nh.advertise(pubIMUOnboardTemp);
	nh.advertise(pubStatus);
	
	// Initialize Subscribers
	nh.subscribe(subCommandVelocity);

	// Initialize Services	
	nh.advertiseService(svcSetCfg);	  
	nh.advertiseService(svcGetCfg);	  
    nh.advertiseService(svcEnableMowerMotor);
	nh.advertiseService(svcReboot);
	
	// Initialize Timers
	NBT_init(&publish_nbt, 1000);
	NBT_init(&panel_nbt, 100);	
	NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
	NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
	NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
	NBT_init(&odom_nbt, ODOM_NBT_TIME_MS);
	NBT_init(&ros_nbt, 10);	
}